# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IConnector..::..Origin Property
IConnector Interface See Also
---
The location of the connector in family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
XYZ Origin { get; }
```

Visual Basic
---
```text
ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
property XYZ^ Origin {
	XYZ^ get ();
}
```

# Remarks
This property is used to retrieve the origin of the connector.
# See Also
IConnector Interface
Autodesk.Revit.DB Namespace